var listening_self_evaluation = {
    "id": "listening@v001",
    "title": "英语听力能力自评表",
    "description": "下表为英语听力能力自评表，请逐条阅读并判断您是否能够达到描述语所说的英语听力能力。请在所选项格中划勾“√”。",
    "choices": {
        "1": "完全做不到",
        "2": "基本做不到",
        "3": "基本能做到",
        "4": "完全能做到"
    },
    "questions": [
        {
            "id": "1",
            "stem": "我能听懂语速较慢、发音标准的日常对话，抓住要点。"
        },
        {
            "id": "2",
            "stem": "我能听懂语速较慢、发音标准的通知或指令，抓住要点。"
        },
        {
            "id": "3",
            "stem": "我能从日常生活中的对话或通知中获取时间、地点、人物等细节性信息。"
        },
        {
            "id": "4",
            "stem": "我能从大多数日常对话中推断出说话者的态度、观点和目的。"
        },
        {
            "id": "5",
            "stem": "我能听懂与我的个人兴趣或工作相关的、发音标准的讨论、谈话或新闻广播的主要内容。"
        },
        {
            "id": "6",
            "stem": "我能听懂常用设备的操作说明。"
        },
        {
            "id": "7",
            "stem": "我能从与我个人兴趣或工作相关的对话中获取重要的细节性信息，推断说话者的态度、观点和目的。"
        },
        {
            "id": "8",
            "stem": "我能从与我个人兴趣相关的新闻广播中获取重要的细节性信息，推断说话者的态度、观点和目的。"
        },
        {
            "id": "9",
            "stem": "我能听懂内容较为复杂的学术讲座或报告，抓住要点。"
        },
        {
            "id": "10",
            "stem": "我能听懂多种话题的、发音标准的新闻广播或纪录片，抓住要点。"
        },
        {
            "id": "11",
            "stem": "我能在大部分的学术讲座、报告、新闻广播或纪录片中获取重要的细节性信息。"
        },
        {
            "id": "12",
            "stem": "我能从大部分的学术讲座、报告或新闻广播中，推断出说话者的态度、观点和目的。"
        },
        {
            "id": "13",
            "stem": "我能较轻松地听懂带有一些不常见表达的各种广播、电视节目和电影。"
        },
        {
            "id": "14",
            "stem": "我能较轻松地听懂带有一些不常见表达的各类讲座或辩论。"
        },
        {
            "id": "15",
            "stem": "我能在有噪音或口音干扰的情况下，较轻松地听懂各种广播通知，准确获取重要细节性信息。"
        },
        {
            "id": "16",
            "stem": "我能较轻松地从各种广播、电影电视节目、讲座或辩论中，推断出说话者的态度、观点和目的。"
        }
    ]
};