var reading_self_evaluation = {
    "id": "reading@v001",
    "title": "阅读能力自评表",
    "description": "请阅读以下能力描述并判断该描述与你自身情况是否相符，并在符合您情况的选项下打钩。",
    "choices": {
        "1": "不能做到",
        "2": "基本做不到",
        "3": "基本能做到",
        "4": "完全能做到"
    },
    "questions": [
        {
            "id": "1",
            "stem": "我能从信件、宣传册、简短的官方文件中找到人名、地名、时间等细节信息。"
        },
        {
            "id": "2",
            "stem": "我能理解作者的写作目的，如问候、告别、感谢、介绍等。"
        },
        {
            "id": "3",
            "stem": "我能区分记叙文、说明文、议论文等不同文体。"
        },
        {
            "id": "4",
            "stem": "我能读懂日常信件，理解信中讲述的事件、表达的情感或愿望等。"
        },
        {
            "id": "5",
            "stem": "我能读懂表达清楚、简单明了的仪器操作说明。"
        },
        {
            "id": "6",
            "stem": "我能理解常见的英语典故、传说、惯用语以及其中的文化内涵。"
        },
        {
            "id": "7",
            "stem": "我能在偶尔遇到生词时，根据上下文推测词义和句义。"
        },
        {
            "id": "8",
            "stem": "我能找出条理清晰的议论文的结论。"
        },
        {
            "id": "9",
            "stem": "我能利用上下文的线索来判断自己对文章的理解是否正确。"
        },
        {
            "id": "10",
            "stem": "我能读懂国内出版的英文报刊和杂志，理解文章的主要观点和事实。"
        },
        {
            "id": "11",
            "stem": "我善于运用文中暗含的线索推断作者态度、情绪和意图，并预测下文。"
        },
        {
            "id": "12",
            "stem": "我能读懂各类信函，包括内容相对复杂的投诉信、咨询信、产品或项目介绍，偶尔需要查词典。"
        },
        {
            "id": "13",
            "stem": "我能理解说明文和议论文中结构复杂、含义深刻的长句。"
        },
        {
            "id": "14",
            "stem": "我能读懂讨论一般社会话题的文章，理解作者的立场和观点。"
        },
        {
            "id": "15",
            "stem": "我能读懂英语国家出版的、非专业领域的报刊杂志，理解文章的主要观点和事实。"
        },
        {
            "id": "16",
            "stem": "我能读懂有难度的历史传记、文学作品、社论、书评，理解主要意思。"
        },
        {
            "id": "17",
            "stem": "我能辨别有难度的历史传记、文学作品、社论、书评里的修辞手法，如明喻、隐喻、反讽等。"
        },
        {
            "id": "18",
            "stem": "我能察觉有难度的历史传记、文学作品、社论、书评的基调，如幽默、讽刺、庄重、尖刻等。"
        },
        {
            "id": "19",
            "stem": "我能读懂讨论政治、经济等话题的长篇复杂文章，理解作者的态度和观点。"
        },
        {
            "id": "20",
            "stem": "我能读懂专业领域的复杂文章，理解其重点。"
        }
    ]
};